//************************************************************************* 
//
// 署名・検証
//
// コマンドライン引数の処理 ヘッダーファイル
//
// ************************************************************************/ 

////////////////////////////
// インクルードガード
////////////////////////////
#ifndef _COMMAND_LINE_HPP_
#define _COMMAND_LINE_HPP_

////////////////////////////
// インクルード
////////////////////////////
#include <filesystem>

////////////////////////////
// 関数宣言
////////////////////////////

// ヘルプ表示(-h, help)
void usage(
    const std::filesystem::path& program_path
);

#endif // _COMMAND_LINE_HPP_
