//************************************************************************* 
//
// 署名・検証
//
// 入出力 ヘッダーファイル
//
// ************************************************************************/ 

////////////////////////////
// インクルードガード
////////////////////////////
#ifndef _IN_OUT_HPP_
#define _IN_OUT_HPP_

////////////////////////////
// インクルード
////////////////////////////
#include <vector>
#include <stdexcept>

////////////////////////////
// 関数宣言
////////////////////////////
// stdinからバイナリデータを読み込む
std::vector<unsigned char> read_stdin( void );
 
// stdoutへバイナリデータを書き出す
void write_stdout(
    const std::vector<unsigned char>& data    // in: 出力するバイナリデータ
);

#endif // _IN_OUT_HPP_
