//************************************************************************* 
//
// 署名・検証
//
// 署名/検証 ヘッダーファイル
//
// ************************************************************************/ 

////////////////////////////
// インクルードガード
////////////////////////////
#ifndef _SIGNATURE_HPP_
#define _SIGNATURE_HPP_

////////////////////////////
// インクルード
////////////////////////////

////////////////////////////
// 関数宣言
////////////////////////////

// 秘密鍵で署名を生成
void signData(
    const std::string& priv_path,   // in: 秘密鍵ファイルパス
    const std::string& sig_path     // in: 署名ファイル出力パス
);

// 公開鍵で署名を検証
void verifyData(
    const std::string& pub_path,    // in: 公開鍵ファイルパス
    const std::string& sig_path     // in: 署名ファイルパス
);

#endif // _SIGNATURE_HPP_
