//************************************************************************* 
//
// RSA 公開鍵暗号方式
//
// 暗号化/復号化 ヘッダーファイル
//
// ************************************************************************/ 

////////////////////////////
// インクルードガード
////////////////////////////
#ifndef _CRYPTO_HPP_
#define _CRYPTO_HPP_

/////////////////////////////
// インクルード
/////////////////////////////

/////////////////////////////
// 関数宣言
/////////////////////////////

// 公開鍵で暗号化
void encryptPubKey(
    const std::string& pub_path     // in: 公開鍵ファイルパス
);

// 秘密鍵で復号化
void decryptPrivKey(
    const std::string& priv_path    // in: 秘密鍵ファイルパス
);

#endif // _CRYPTO_HPP_
