//************************************************************************* 
//
// RSA 公開鍵暗号方式
//
// キー生成 ヘッダーファイル
//
// ************************************************************************/ 

////////////////////////////
// インクルード
////////////////////////////
#include <filesystem>

////////////////////////////
// 関数宣言
////////////////////////////

// 秘密鍵、公開鍵生成して出力
void generateKeypair(
    const std::string& priv_path,   // in: 秘密鍵ファイルパス
    const std::string& pub_path,    // in: 公開鍵ファイルパス
    int bits                        // in: 鍵のビット数
);